Repository: giellalt/corpus-nob
Catalog: prestable/tmx/smj/facta/other_files/rammeplan_for_barnehagen.pdf.tmx
Source language: nob
Languages: smj

source: Dette er de betegnelsene som er brukt i barnehageloven.
smj: Dá li da nammadusá ma li mánájgárddelágan aneduvvam.

source: Rammeplanens øvrige kapitler inneholder plikter for barnehagens personale og omfatter alle som arbeider i barnehagen.
smj: Rámmaplána ietjá kapihttalijn gávna mánájgárddebarggij vælggogisvuodajt ja dá gulluji gájkajda gudi mánájgárden barggi.

source: Barnehagelærere er den profesjonen som utdannes spesielt for å kunne ivareta barnehagens oppgaver.
smj: Mánájgárddeåhpadiddje le dat profesjåvnnå mij åhpaduvvá mánájgárde dåjmajt bærrájgåtsåtjit.

source: Barnehagen er en lærende organisasjon der hele personalet skal reflektere rundt faglige og etiske problemstillinger, oppdatere seg og være tydelige rollemodeller.
smj: Mánájgárdde le organisasjåvnnå gånnå bargge oahppi ja galggi árvvaladdat fágalasj ja estetalasj tjuolmajt, fágalattjat ja liehket oalle rållamodella.

source: De skal ivareta relasjoner mellom barna i grupper, mellom barn og personalet og mellom personalet og foreldre.
smj: Sij galggi bærrá jgåhtset aktijvuodav manáj gaskan juohkusijn, mánáj ja barggij gaskan ja barggij ja æjgádij gaskan.

source: Barnehageeier
smj: Mánájgárddeæjgáda

source: Barnehageeieren har det overordnede ansvaret for at barnehagen drives i samsvar med gjeldende lover og regelverk, jf. barnehageloven § 7 første ledd.
smj: Mánájgárddeæjgádin le bajemus åvdåsvásstádus vaj mánájgárdde dåjmaduvvá doajmme lágaj ja njuolgadusáj milta, bs. mánájgárddelágav § 7 vuostasj oasse.

source: Barnehageeieren har dermed juridisk ansvar for kvaliteten på barnehagetilbudet.
smj: Mánájgárddeæjgádin le dan diehti juridihkalasj åvdåsvásstádus mánájgárddefálaldagá kvalitiehtas.

source: Et kompetent pedagogisk personale er en forutsetning for et barnehagetilbud av god kvalitet. Det forutsettes derfor at barnehageeieren vektlegger de ansattes faglige og pedagogiske vurderinger i sin styring.
smj: Bargge máhtudagájn le gájbbádussan vaj mánájgárddefálaldahka sjaddá buorren, dan diehti le vuordedahtte vaj mánájgárddeæjgát dættot barggij fágalasj ja pedagogihkalasj árvustallamav jådedijn.

source: Barnehageeieren kan tilpasse rammeplanen til lokale forhold, jf. barnehageloven § 2 åttende ledd.
smj: Mánájgárddeæjgát máhttá rámmaplánav hiebadit bájkálasj dilijda, bs. mánájgárddeláhka § 2 gávtsát oasse.

source: Barnehageeierens lokale tilpasning bør fremgå av barnehagens vedtekter.
smj: Mánájgárddeæjgáda bájkálasj hiebadibme bierri åvddånboahtet mánájgárde njuolgadusájs.

source: Styrer
smj: Jådediddje

source: Styreren er gitt det daglige ansvaret i barnehagen;
smj: Jådediddjen le bæjválasj åvdåsvásstádus mánájgárdes;

source: pedagogisk, personalmessig og administrativt.
smj: pedagogihkalattjat, barggij hárráj ja háldadime hárráj.

source: Styreren skal sørge for at det pedagogiske arbeidet er i tråd med barnehageloven og rammeplanen, og at personalet utvikler en felles forståelse for oppdraget som er gitt i disse.
smj: Jådediddje galggá bærrájgæhttjat vaj pedagogihkalattjat barggo mánájgárddelágav ja rámmaplánav tjuovvu, ja vaj bargge åmastit aktisasj dádjadusáv bargos mij tjuovvu.

source: Styreren skal sørge for at personalet får ta i bruk sin kompetanse.
smj: Jådediddje galggá bærrájgæhttjat vaj bargge bessi máhtudagás adnuj válldet.

source: En forutsetning for en forsvarlig pedagogisk og administrativ ledelse er et godt samarbeid med barnehageeieren, barnehagens pedagogiske ledere og barnehagens øvrige personale.
smj: Gájbbádussan buorre pedagogihkalasj ja háldadusá jådedibmáj le buorre aktisasjbarggo mánájgárddeæjgádijn, mánájgárde pedagogihkalasj jådediddjijn ja mánájgárde ietjá barggij.

source: Styreren leder og følger opp arbeidet med planlegging, dokumentasjon, vurdering og utvikling av barnehagens innhold og arbeidsmåter og sørger for at hele personalgruppen involveres.
smj: Jådediddje jådet ja gåtset mánájgárde pládnabargov, dokumentasjåvnåv, árvustallamav ja mánájgárde sisano ja barggovuogij åvddånahttemav ja bærrájgæhttjá vaj ålles barggijjuogos bargguj oassálasstá.

source: Styreren skal sikre at barnehagen har innarbeidet rutiner for samarbeid med relevante institusjoner, slik som skolen, helsestasjonen, den pedagogisk- psykologiske tjenesten og barnevernet.
smj: Jådediddje vásstet vaj mánájgárden li doajmme vuoge aktisasjbargguj guoskavasj institusjåvnåjda, duola degu skåvllå, varresvuodastasjåvnnå, pedagogihkalasj- psykologijjalasj dievnastus ja mánájsuodjalibme.

source: Pedagogisk leder
smj: Pedagogihkalasj jådediddje

source: Pedagogisk leder er gitt ansvaret for å iverksette og lede det pedagogiske arbeidet, i tråd med godt faglig skjønn.
smj: Pedagogihkalasj jådediddje åvdåsvásstádus le jåhtuj biedjat ja jådedit pedagogihkalasj bargov, buorre fágalasj dájdo milta.

source: Den pedagogiske lederen skal veilede og sørge for at barnehageloven og rammeplanen oppfylles gjennom det pedagogiske arbeidet.
smj: Pedagogihkalasj jådediddje galggá bagádallat ja gåtsedit vaj mánájgárddeláhka ja rámmapládna tjuovoduvvaba pedagogihkalasj bargo baktu.

source: Den pedagogiske lederen leder arbeidet med planlegging, gjennomføring, dokumentasjon, vurdering og utvikling av arbeidet i barnegruppen eller innenfor de områdene han/hun er satt til å lede.
smj: Pedagogihkalasj jådediddje jådet bargov plánidattijn, tjadádimijn, árvustallamijn ja bargo åvddånahttemijn mánájjuohkusin jali dan suorgen majt sån jådet.

source: 3. Barnehagens formål og innhold
smj: 3. Mánájgárde ulmme ja sisadno

source: Barnehagens innhold skal være allsidig, variert og tilpasset enkeltbarnet og barne gruppen.
smj: Mánájgárde sisadno galggá liehket gájkbelak, målsudahkes ja hiebaduvvam ájnegis mánnáj ja mánájjuohkusij.

source: I barnehagen skal barna få leke og utfolde skaperglede, undring og utforskertrang.
smj: Mánájgárden galggi máná bessat ståhkat ja dåmadimávov åvdedit, imájdallamav ja diehtemvájnogisvuodav.

source: Arbeidet med omsorg, danning, lek, læring, sosial kompetanse og kommunikasjon og språk skal ses i sammenheng og samlet bidra til barns allsidige utvikling.
smj: Barggo mij guosská huksuj, ávddamij, ståhkamij, oahppamij, sosiála máhtudahkaj ja guládallamij ja giellaj dáhpáduvvá avta bále ja tjoahken åvdedi máná gájkbelak åvddånimev.

source: I samiske barnehager skal dette arbeidet bygge på samisk språk, kultur og tradisjonskunnskap.
smj: Sáme mánájgárdijn galggá dat barggo tjanáduvvat sámegiellaj, kultuvrraj ja árbbediehtuj.

source: Barnehagen skal være en kulturarena hvor barna er medskapere av egen kultur i en atmosfære preget av humor og glede.
smj: Mánájgárdde galggá liehket kultuvrraarená gånnå máná ietja li siegen dahkamin ietjasa kultuvrav dilen gånnå bessi ávvudallat ja suohtastallat.

source: Barnehagens fysiske miljø skal være trygt og utfordrende og gi barna allsidige bevegelseserfaringer.
smj: Mánájgárde birás galggá liehket jasska ja hásstaliddje ja vaddet mánájda gájkbelak labudallamåtsådallamijt.

source: Personalet skal utforme det fysiske miljøet slik at alle barn får muligheter til å delta aktivt i lek og andre aktiviteter, og slik at leker og materiell er tilgjengelig for barna.
smj: Bargge galggi birrasav hábbmit vaj divna máná bessi ståhkamijda ja ietjá dåjmajda oassálasstet, ja vaj ståhkusa ja gávne li mánájda sadjihin.

source: Barnehagen skal ivareta barnas behov for omsorg
smj: Mánájgárdde galggá bærrájgåhtset mánáj dárbov huvso hárráj

source: Omsorg er en forutsetning for barnas trygghet og trivsel, og for utvikling av empati og nestekjærlighet.
smj: Hukso le ájnas mánáj jasskavuoda ja soapptsoma hárráj, ja empatijja ja guojmmegieresvuoda åvddånime hárráj.

source: Barnehagen skal gi barna mulighet til å utvikle tillit til seg selv og andre.
smj: Mánájgárdde galggá mánájda vaddet máhttelisvuodav åvddånahttet luohtádusáv allasisá ja iehtjádijda.

source: I barnehagen skal alle barna oppleve å bli sett, forstått, respektert og få den hjelp og støtte de har behov for.
smj: Mánájgárden galggi divna máná vuojnnut, dádjaduvvat, vieleduvvat ja oadtjot dav viehkev ja dårjav majt dárbahi.

source: Barnehagen skal aktivt legge til rette for omsorgsfulle relasjoner mellom barna og personalet og mellom barna, som grunnlag for trivsel, glede og mestring.
smj: Mánájgárdde galggá ásadit huvsulasj aktijvuodav mánáj ja barggij gaskan, ja mánáj ietjasij gaskan, mij le vuodon soapptsomij, ávvuj ja rijbadibmáj.

source: Personalet skal arbeide for et miljø som ikke bare gjør barna til mottakere av omsorg, men som også verdsetter barnas egne omsorgshandlinger.
smj: Bargge galggi bargov dahkat birrasa hárráj mij ij dagá mánájt dåssju huvso vuosstájvállden, valla aj dakkárin ma árvvon adni iehtjádijt huksat.

source: Personalet skal
smj: Bargge galggi

source: • ivareta barnas behov for fysisk omsorg, inkludert behov for ro og hvile
smj: • bærrájgåhtset mánáj rubbmelasj dárbov, duola dagu dárbov vuojŋadit

source: • legge til rette for at barna kan knytte seg til personalet og til hverandre
smj: • ásadit dilev vaj máná tjadnasi barggijda ja guhtik guojmmásisá

source: • sørge for at alle barn opplever trygghet, tilhørighet og trivsel i barnehagen
smj: • bærrájgæhttjat vaj divna máná jasskavuodav åtsådalli, gulluvasjvuodav ja

source: • møte alle barn med åpenhet, varme og interesse og vise omsorg for
smj: • duosstot divna mánájt rabás mielajn, liekkosvuodajn ja berustimijn, ja huvsov

source: hvert enkelt barn
smj: vuosedit juohkka ájnna mánnáj

source: • være lydhør for barnas uttrykk og imøtekomme deres behov for omsorg
smj: • liehket gullisa mánáj åvddånbuktemijda ja duosstot sijá dárbov huksuj

source: med sensitivitet
smj: hiellesvuodajn

source: • støtte og oppmuntre barna til å vise omsorg for andre og til selv å kunne
smj: • doarjjot ja hasodit mánájt huvsatjit nubbe nuppev ja ietja huvsov åmastit

source: • bidra til at barna kan utvikle tillit til seg selv og andre.
smj: • viehkedit mánájt luohtedit allasisá ja iehtjádijda

source: Barnehagen skal ivareta barnas behov for lek
smj: Mánájgárdde galggá bærrájgåhtset mánáj dárbov ståhkama hárráj

source: Leken skal ha en sentral plass i barnehagen, og lekens egenverdi skal anerkjennes.
smj: Ståhkamij galggá liehket guovdásj sadje mánájgárden, ja ståhkama árvvo galggá dåhkkiduvvat.

source: Barnehagen skal gi gode vilkår for lek, vennskap og barnas egen kultur.
smj: Mánájgárdde galggá buorre ævtojt vaddet ståhkamij, rádnastallamij ja mánáj ietjasij kultuvrraj.

source: Leken skal være en arena for barnas utvikling og læring, og for sosial og språklig samhandling.
smj: Ståhkam galggá liehket arenán mánáj åvddånibmáj ja oahppamij, ja sosiála ja gielalasj avtastallamij.

source: Barnehagen skal inspirere til og gi rom for ulike typer lek både ute og inne.
smj: Mánájgárdde galggá arvusmahttet ja sajev vaddet duon dán ståhkamij ålggon ja sinna.

source: Barnehagen skal bidra til at alle barn kan oppleve glede, humor, spenning og engasjement gjennom lek – alene og sammen med andre.
smj: Mánájgárdde galggá viehkedit vaj divna máná bessi ávov åtsådallat, suohtastallamav, geldulasjvuodav ja berustimev ståhkama baktu, juogu aktu jali rádnaj siegen.

source: • organisere rom, tid og lekemateriale for å inspirere til ulike typer lek
smj: • organiserit sajev, ájgev ja ståhkamgávnijt arvusmahtátjit duon dán ståhkamij

source: • bidra til at barna får felles erfaringer som grunnlag for lek og legge til
smj: • viehkedit vaj máná oadtju aktisasj åtsådallamijt vuodon ståhkamij ja ásadit

source: rette for utvikling av leketemaer
smj: dilev ståhkamtiemáj åvddånahttemij

source: • fremme et inkluderende miljø der alle barna kan delta i lek og erfare
smj: • åvdedit sebrudahtte birrasav gånnå divna máná máhtti ståhkamij oassálasstet

source: glede i lek
smj: ja ávov dåbddåt ståhkama baktu

source: • observere, analysere, støtte, delta i og berike leken på barnas
smj: • gæhttjat, analyserit, doarjjot, oassálasstet ja boanndodit ståhkamav mánáj

source: premisser
smj: premissaj baktu

source: • veilede barna hvis leken medfører uheldige samspillsmønstre
smj: • bagádallat mánájt jus ståhkam buktá nievrep avtastallamvuogijt

source: • være bevisst på og vurdere egen rolle og deltakelse i barnas lek
smj: • liehket diedulasj ja árvustallat ietjas rållav ja oassálasstemav gå máná ståhki

source: • ta initiativ til lek og aktivt bidra til at alle kommer inn i leken.
smj: • álgadit ståhkamav ja viehkedit vaj divna sihti ståhkat

source: Barnehagen skal fremme danning
smj: Mánájgárdde galggá ávddamav åvdedit

source: Barnehagen skal støtte barna i å forholde seg prøvende og nysgjerrig til omverdenen og bidra til å legge grunnlag for modig, selvstendig og ansvarlig deltakelse i demokratiske fellesskap.
smj: Mánájgárdde galggá doarjjot mánájt gæhttjalittjat ja njunjágahtátjit birrusav ja viehkedit måvtugis, iesjrádálasj ja vásstediddje oassálasstemij demokratijjalasj aktisasjvuodan.

source: Barnehagen skal fremme samhold og solidaritet samtidig som individuelle uttrykk og handlinger skal verdsettes og følges opp.
smj: Mánájgárdde galggá åvdedit avtamielakvuodav ja solidaritiehtav sæmmi båttå gå individuála åvddånbuktema ja dåjma galggi árvvon aneduvvat ja gåtseduvvat.

source: Barnehagen skal bidra til at barna kan forstå felles verdier og normer som er viktige for fellesskapet.
smj: Mánájgárdde galggá mánájt viehkedit dádjadittjat aktisasj árvojt ja dábijt ma li aktisasjvuohtaj ájnnasa.

source: Barnehagen skal bidra til å fremme barnas tilhørighet til samfunnet, natur og kultur.
smj: Mánájgárdde galggá åvdedit mánáj gulluvasjvuodav sebrudahkaj, luonnduj ja kultuvrraj.

source: I barnehagen skal barna få delta i beslutningsprosesser og utvikling av felles innhold.
smj: Mánájgárden galggi máná bessat mierredimprosessajda oassálasstet ja aktisasj sisano åvddånahttemij.

source: Barna skal støttes i å uttrykke synspunkter og skape mening i den verden de er en del av.
smj: Máná galggi hasoduvvat åvddånbuvtátjit vuojnojt ja ájádusájt dan væráldin gånnå sij li oassálasste.

source: Gjennom samspill, dialog, lek og utforsking skal barnehagen bidra til at barna utvikler kritisk tenkning, etisk vurderingsevne, evne til å yte motstand og handlingskompetanse, slik at de kan bidra til endringer.
smj: Avtastallama, dialåvgå, ståhkama ja njunjágahttema baktu galggá mánájgárdde viehkedit mánájt åvddånahtátjit lájttalis ájádallamav, etihkalasj árvustallammáhtukvuodav, máhtukvuodav vuosteldittjat ja doajmmamáhtudagáv, vaj rievddamijt máhtti dahkat.

source: • tilrettelegge for meningsfulle opplevelser og støtte barnas identitets
smj: • ásadit mávsulasj vásádusájt ja doarjjot mánáj identitiehta åvddånahttemav

source: utvikling og positive selvforståelse
smj: ja positijva iesjdádjadusáv

source: • støtte barnas aktivitet, engasjement og deltakelse i fellesskapet
smj: • doarjjot mánáj dåjmajt, berustimev ja aktisasjvuoda oassálasstemav

source: • synliggjøre og verdsette ulike behov, meninger og perspektiver i
smj: • tjalmostit ja árvvon adnet duov dáv dárbov, vuojnov ja perspektijvaj

source: fellesskapet
smj: aktisasjvuodan

source: • legge merke til, anerkjenne og følge opp barnas perspektiver og
smj: • vuojnnet, dåhkkidit ja gåtsedit mánáj perspektijvav ja dåjmajt

source: • utfordre barnas tenkning og invitere dem inn i utforskende samtaler
smj: • hásstalit mánáj ájádallamav ja bivddit njunjágahttem ságastallamijda

source: • synliggjøre og fremheve mangfold og ulikhet som grunnlag for
smj: • tjalmostahttet ja dættodit moattevuodav ja ærádisáv vuodon åtsådallamijda,

source: opplevelser, utforsking og læring.
smj: njunjágahttemij ja oahppamij

source: Barnehagen skal fremme læring
smj: Mánájgárdde galggá oahppamav åvdedit

source: I barnehagen skal barna oppleve et stimulerende miljø som støtter opp om deres lyst til å leke, utforske, lære og mestre.
smj: Mánájgárden galggi máná vásedit arvusmahtte birrasav mij doarjju sijá mielav stågatjit, guoradalátjit, åhpatjit ja rijbadittjat.

source: Barnehagen skal introdusere nye situasjoner, temaer, fenomener, materialer og redskaper som bidrar til meningsfull samhandling.
smj: Mánájgárdde galggá oahpásmahttet ådå dilijda, tiemájda, dáhpádusájda, materiálajda ja ræjdojda ma vaddi mávsulasj avtastallamav.

source: Barnas nysgjerrighet, kreativitet og vitebegjær skal anerkjennes, stimuleres og legges til grunn for deres læringsprosesser.
smj: Mánáj njunjágahttem, sjuggelisvuohta ja diehtemvájnno galggá dåhkkiduvvat, arvusmahteduvvat ja biejaduvvat vuodon sijá oahppamprosæssaj.

source: Barna skal få undersøke, oppdage og forstå sammenhenger, utvide perspektiver og få ny innsikt.
smj: Máná galggi bessat guoradallat, ájttsat ja dádjadit aktijvuodajt, vijdedit perspektijvajt ja åmastit ådå dádjadusáv.

source: Barna skal få bruke hele kroppen og alle sanser i sine læringsprosesser.
smj: Máná galggi ålles rubmahav ja divna dåbdudagájt adnet ietjasa oahppamprosessajn.

source: Barnehagen skal bidra til læringsfellesskap der barna skal få bidra i egen og andres læring.
smj: Mánájgárdde galggá vaddet oahppamaktisasjvuodav gånnå máná bessi ietjasa ja iehtjádij oahppamij oassálasstet.

source: • sørge for et inkluderende fellesskap og legge til rette for at barn kan
smj: • ásadit sebrudahtte aktisasjvuodav ja ásadit mánájda vaj máhtti oasev válldet

source: bidra i egen og andres læring
smj: ietjasa ja iehtjádij oahppamis.

source: • legge til rette for helhetlige læringsprosesser som fremmer barnas
smj: • ásadit ålles oahppamprosessajt ma åvdedi mánáj soapptsomav ja gájkbelak

source: trivsel og allsidige utvikling
smj: åvddånahttemav

source: • være oppmerksomme på barnas interesser og engasjement og legge
smj: • ájttsat manáj berustimijt ja ásadit máhttelisvuodav oahppamij duon dán dilen

source: til rette for læring i ulike situasjoner og aktiviteter
smj: ja dåjman

source: • støtte og berike barnas initiativ, undring, nysgjerrighet, kreativitet,
smj: • doarjjot ja boanndodit mánáj dåjmalasjvuodav, imájdallamav, njunjágahtte

source: læringslyst og tiltro til egne evner
smj: mav, sjuggelisvuodav, oahppammielav ja åskeldimev ietjasa vaddásijda

source: • utvide barnas erfaringer og sørge for progresjon og utvikling i
smj: • vijdedit mánáj åtsådallamijt ja bærrájgæhttjat progresjåvnåv ja åvddånimev

source: barnehagens innhold
smj: mánájgárde sisano hárráj

source: • støtte barnas refleksjoner rundt situasjoner, temaer og fenomener
smj: • doarjjot mánáj ájádusájt dilij, tiemáj ja dáhpádusáj hárráj ja ásadit dádjadusáv

source: og skape forståelse og mening sammen med dem
smj: sijájn aktan

source: • sørge for at alle barn kan få rike og varierte opplevelser og erfaringer,
smj: • bærrájgæhttjat vaj divna máná oadtju boandás ja målsudahkes åtsådallamijt

source: utfordringer og mestringsopplevelser.
smj: ja vásádusájt, hásstalusájt ja rijbadimåtsådallamijt

source: Barnehagen skal fremme vennskap og fellesskap
smj: Mánájgárdde galggá rádnastallamav ja aktisasjvuodav åvdedit

source: Sosial kompetanse er en forutsetning for å fungere godt sammen med andre og omfatter ferdigheter, kunnskaper og holdninger som utvikles gjennom sosialt samspill.
smj: Sosiála máhtudahka le gájbbedahtte dåjmatjit buoragit iehtjádij siegen, ja dat máhtudagá li tjehpudagá, diedo ja guotto ma åvddåni sosiála avtastallama baktu.

source: I barnehagen skal alle barn kunne erfare å være betydningsfulle for fellesskapet og å være i positivt samspill med barn og voksne.
smj: Mánájgárden galggi divna máná dåbddåt ietjasa aktisasjvuohtaj ájnnasin ja liehket buorre avtastallamin mánáj ja ållessjattugij siegen.

source: Barnehagen skal aktivt legge til rette for utvikling av vennskap og sosialt fellesskap.
smj: Mánájgárdde galggá dåjmalattjat ásadit vaj rádnastallam ja sosiála aktisasjvuohta åvddån.

source: Barnas selvfølelse skal støttes, samtidig som de skal få hjelp til å mestre balansen mellom å ivareta egne behov og det å ta hensyn til andres behov.
smj: Mánáj iesjdåbddo galggá doarjoduvvat, sæmmi båttå gå galggi viehkev oadtjot bærrájgåtsåtjit ietjasa dárbov ja vieledittjat iehtjádij dárbojt.

source: • støtte barnas initiativ til samspill og bidra til at alle kan få leke med andre,
smj: • doarjjot mánáj dåjmalasjvuodav avtastallamij ja máhttelisvuodav vaj divna

source: oppleve vennskap og lære å beholde venner
smj: bessi ståhkat iehtjádij, ja rádnastallamav åtsådallat ja bisodit

source: • samtale om normer for samhandling og invitere barna til å utforme
smj: • ságastallat avtastallam dábij birra ja bivddit mánájt hábbmitjit dábijt aktisa

source: normer for samhandling i fellesskap
smj: sjvuoda avtastallamijda

source: • støtte barna i å ta andres perspektiv, se en sak fra flere synsvinkler og
smj: • doarjjot mánájt vuojnátjit iehtjádij perspektijvajt, vuojnnet ássjijt moattet

source: reflektere over egne og andres følelser, opplevelser og meninger
smj: guovlos ja ájádallat ietjasa ja iehtjádij dåbdoj hárráj, åtsådallamij ja vuojnoj

source: • støtte barna i å sette egne grenser, respektere andres grenser og finne
smj: • mánájt doarjjot rájájt biejatjit, vieledit iehtjádij rájájt ja gávnnat tjoavddusijt

source: løsninger i konfliktsituasjoner
smj: rijdoj vuolen

source: • forebygge, stoppe og følge opp diskriminering, utestenging, mobbing,
smj: • duostodit, ganugahttet ja gåtsedit badjelgæhttjamav, ålgodimev, givsedimev,

source: krenkelser og uheldige samspillsmønstre.
smj: illastimev ja nievres avtastallamvuogijt

source: Barnehagen skal fremme kommunikasjon og språk
smj: Mánájgárdde galggá guládallamav ja gielav åvdedit

source: Barnehagen skal være bevisst på at kommunikasjon og språk påvirker og påvirkes av alle sider ved barnets utvikling.
smj: Mánájgárdde galggá liehket diedulasj jut guládallam ja giella vájkkut ja vájkkuduvvá juohkkat bieles mánáj åvddånahtedijn.

source: Gjennom dialog og samspill skal barna støttes i å kommunisere, medvirke, lytte, forstå og skape mening.
smj: Dialåvgå ja avtastallama baktu galggi máná hasoduvvat guládalátjit, aktan dåjmatjit, gulldalittjat, dádjadittjat ja ájádusájt hábbmitjit.

source: Barnehagen skal anerkjenne og verdsette barnas ulike kommunikasjonsuttrykk og språk, herunder tegnspråk.
smj: Mánájgárdde galggá dåhkkidit ja árvvon adnet mánáj moattelágásj giella ja guládallamvuogijt, sevvamgiellaj aj.

source: Alle barn skal få god språkstimulering gjennom barne hagehverdagen, og alle barn skal få delta i aktiviteter som fremmer kommunikasjon og en helhetlig språkutvikling.
smj: Divna máná galggi oadtjot buorre giellaarvusmahttemav bæjválattjat mánájgárden, ja divna máná galggi bessat oassálasstet dåjmajda ma guládallamav ja ålles giellaåvddånimev åvdedi.

source: I barnehager for samiske barn i samiske distrikt skal barnehagen fremme barnas samiskspråklige kompetanse.
smj: Mánájgárdijn sáme mánájda sáme guovlojn galggá mánájgárdde mánáj sámegielak máhtudagáv åvdedit.

source: • anerkjenne og respondere på barnas ulike verbale og non-verbale
smj: • dåhkkidit ja responderit mánáj moattelágásj verbála ja verbáladis

source: uttrykk og støtte deres språkutvikling
smj: moalgedimijt ja sijá giellaåvddånimev doarjjot

source: • stimulere barns verbale og non-verbale kommunikasjon og legge til
smj: • arvusmahttet mánáj verbála ja verbáladis guládallamav ja viehkedit vaj

source: rette for at alle barn involveres i samspill og i samtaler
smj: divna máná sehkani avtastallamij ja ságastallamijda

source: • sørge for at alle barn får varierte og positive erfaringer med å bruke språk
smj: • bærrájgæhttjat vaj divna máná oadtju målsudahkes ja buorre åtsådallamijt

source: som kommunikasjonsmiddel, som redskap for tenkning og som uttrykk for egne tanker og følelser
smj: gå gielav adni guládallamnævvon, ræjddon ájádallamijda, ja ietjasa ájádusájda ja dåbdojda

source: • være bevisst på sine roller som språklige forbilder og være lydhøre i
smj: • liehket diedulattja ietjasa roallaj giellaåvddågåvvån ja liehket gullisa gå
